In [1]:
import pandas as pd

In [2]:
friends = [{'name':'John','age':15, 'job':'stu'},
           {'name':'Ben','age':25, 'job':'dev'},
           {'name':'Jenny','age':30, 'job':'tea'}]
df = pd.DataFrame(friends, columns = ['name','age', 'job'])

In [3]:
df

    name  age  job
0   John   15  stu
1    Ben   25  dev
2  Jenny   30  tea

샐러리 라는 열을 넣어줌

In [4]:
df['salary'] = 0

In [5]:
df.head()

    name  age  job  salary
0   John   15  stu       0
1    Ben   25  dev       0
2  Jenny   30  tea       0

새로운 열이 들어감

In [7]:
import numpy as np

In [8]:
df['salary'] = np.where(df['job'] != 'stu', 'yes', 'no')

In [9]:
df

    name  age  job salary
0   John   15  stu     no
1    Ben   25  dev    yes
2  Jenny   30  tea    yes

In [13]:
friends = [{'name':'John','midterm':95, 'final':85},
           {'name':'Ben','midterm':85, 'final':80},
           {'name':'Jenny','midterm':30, 'final':10}]
df = pd.DataFrame(friends, columns = ['name','midterm', 'final'])

In [14]:
df

    name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10

In [15]:
df['total'] = df['midterm'] + df['final']

In [19]:
df

    name  midterm  final  total   avg
0   John       95     85    180  90.0
1    Ben       85     80    165  82.5
2  Jenny       30     10     40  20.0

In [20]:
df['avg'] = df['total'] / 2

In [21]:
df

    name  midterm  final  total   avg
0   John       95     85    180  90.0
1    Ben       85     80    165  82.5
2  Jenny       30     10     40  20.0

In [26]:
grades = []

for row in df['avg']:
    if row >= 90 :
        grades.append('A')
    elif row >= 80 :
        grades.append('B')
    else :
        grades.append('F')
        
df['grad'] = grades

In [27]:
df

    name  midterm  final  total   avg grad
0   John       95     85    180  90.0    A
1    Ben       85     80    165  82.5    B
2  Jenny       30     10     40  20.0    F

In [29]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else :
        return 'Fail'
    
df.grad = df.grad.apply(pass_or_fail) # apply를 통해 수정

In [30]:
df

    name  midterm  final  total   avg  grad
0   John       95     85    180  90.0  Pass
1    Ben       85     80    165  82.5  Pass
2  Jenny       30     10     40  20.0  Fail

In [31]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [32]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

년도만 빼고 싶으면 아까처럼 apply를 사용하면 된다.

In [33]:
def f(row):
    return row.split('-')[0] # -로 구분해서 첫 번째만 받음

In [36]:
df['year'] = df['yyyy-mm-dd'].apply(f) # 새로운 year을 만들어서 yyyy-mm-dd에 f함수를 불러서 년도만 가져옴

In [37]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [38]:
friends = [{'name':'John','age':15, 'job':'stu'},
           {'name':'Ben','age':25, 'job':'dev'},
           {'name':'Jenny','age':30, 'job':'tea'}]
df = pd.DataFrame(friends, columns = ['name','age', 'job'])

In [39]:
df

    name  age  job
0   John   15  stu
1    Ben   25  dev
2  Jenny   30  tea

In [43]:
friends = [{'name':'John','midterm':95, 'final':85},
           {'name':'Ben','midterm':85, 'final':80},
           {'name':'Jenny','midterm':30, 'final':10}]
df = pd.DataFrame(friends, columns = ['name','midterm', 'final'])

In [44]:
df

    name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10

In [47]:
df2 = pd.DataFrame([
    ['Kim',50,50]
], columns = ['name', 'midterm', 'final'])

In [48]:
df2

  name  midterm  final
0  Kim       50     50

위에 오리지널 friends와 df2를 합침

In [50]:
df.append(df2, ignore_index = True) # ingnore_index는 인덱스를 기존에 적용시켜라라는 뜻

C:\Users\a0102\AppData\Local\Temp\ipykernel_16992\3177770813.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index = True) # ingnore_index는 인덱스를 기존에 적용시켜라라는 뜻

    name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10
3    Kim       50     50